GopalSaraf/Practicals/PSDL/include/proc/pic18f13k22.inc
// Register: IOCB
#define IOCB IOCB
IOCB                                     equ 0F7Ah
// bitfield definitions
IOCB_IOCB_POSN                           equ 0004h
IOCB_IOCB_POSITION                       equ 0004h
IOCB_IOCB_SIZE                           equ 0004h
IOCB_IOCB_LENGTH                         equ 0004h
IOCB_IOCB_MASK                           equ 00F0h
IOCB_IOCB4_POSN                          equ 0004h
IOCB_IOCB4_POSITION                      equ 0004h
IOCB_IOCB4_SIZE                          equ 0001h
IOCB_IOCB4_LENGTH                        equ 0001h
IOCB_IOCB4_MASK                          equ 0010h
IOCB_IOCB5_POSN                          equ 0005h
IOCB_IOCB5_POSITION                      equ 0005h
IOCB_IOCB5_SIZE                          equ 0001h
IOCB_IOCB5_LENGTH                        equ 0001h
IOCB_IOCB5_MASK                          equ 0020h
IOCB_IOCB6_POSN                          equ 0006h
IOCB_IOCB6_POSITION                      equ 0006h
IOCB_IOCB6_SIZE                          equ 0001h
IOCB_IOCB6_LENGTH                        equ 0001h
IOCB_IOCB6_MASK                          equ 0040h
IOCB_IOCB7_POSN                          equ 0007h
IOCB_IOCB7_POSITION                      equ 0007h
IOCB_IOCB7_SIZE                          equ 0001h
IOCB_IOCB7_LENGTH                        equ 0001h
IOCB_IOCB7_MASK                          equ 0080h

// Register: ANSEL
#define ANSEL ANSEL
ANSEL                                    equ 0F7Eh
// bitfield definitions
ANSEL_ANSEL_POSN                         equ 0000h
ANSEL_ANSEL_POSITION                     equ 0000h
ANSEL_ANSEL_SIZE                         equ 0008h
ANSEL_ANSEL_LENGTH                       equ 0008h
ANSEL_ANSEL_MASK                         equ 00FFh
ANSEL_ANS0_POSN                          equ 0000h
ANSEL_ANS0_POSITION                      equ 0000h
ANSEL_ANS0_SIZE                          equ 0001h
ANSEL_ANS0_LENGTH                        equ 0001h
ANSEL_ANS0_MASK                          equ 0001h
ANSEL_ANS1_POSN                          equ 0001h
ANSEL_ANS1_POSITION                      equ 0001h
ANSEL_ANS1_SIZE                          equ 0001h
ANSEL_ANS1_LENGTH                        equ 0001h
ANSEL_ANS1_MASK                          equ 0002h
ANSEL_ANS2_POSN                          equ 0002h
ANSEL_ANS2_POSITION                      equ 0002h
ANSEL_ANS2_SIZE                          equ 0001h
ANSEL_ANS2_LENGTH                        equ 0001h
ANSEL_ANS2_MASK                          equ 0004h
ANSEL_ANS3_POSN                          equ 0003h
ANSEL_ANS3_POSITION                      equ 0003h
ANSEL_ANS3_SIZE                          equ 0001h
ANSEL_ANS3_LENGTH                        equ 0001h
ANSEL_ANS3_MASK                          equ 0008h
ANSEL_ANS4_POSN                          equ 0004h
ANSEL_ANS4_POSITION                      equ 0004h
ANSEL_ANS4_SIZE                          equ 0001h
ANSEL_ANS4_LENGTH                        equ 0001h
ANSEL_ANS4_MASK                          equ 0010h
ANSEL_ANS5_POSN                          equ 0005h
ANSEL_ANS5_POSITION                      equ 0005h
ANSEL_ANS5_SIZE                          equ 0001h
ANSEL_ANS5_LENGTH                        equ 0001h
ANSEL_ANS5_MASK                          equ 0020h
ANSEL_ANS6_POSN                          equ 0006h
ANSEL_ANS6_POSITION                      equ 0006h
ANSEL_ANS6_SIZE                          equ 0001h
ANSEL_ANS6_LENGTH                        equ 0001h
ANSEL_ANS6_MASK                          equ 0040h
ANSEL_ANS7_POSN                          equ 0007h
ANSEL_ANS7_POSITION                      equ 0007h
ANSEL_ANS7_SIZE                          equ 0001h
ANSEL_ANS7_LENGTH                        equ 0001h
ANSEL_ANS7_MASK                          equ 0080h
ANSEL_ANSEL0_POSN                        equ 0000h
ANSEL_ANSEL0_POSITION                    equ 0000h
ANSEL_ANSEL0_SIZE                        equ 0001h
ANSEL_ANSEL0_LENGTH                      equ 0001h
ANSEL_ANSEL0_MASK                        equ 0001h
ANSEL_ANSEL1_POSN                        equ 0001h
ANSEL_ANSEL1_POSITION                    equ 0001h
ANSEL_ANSEL1_SIZE                        equ 0001h
ANSEL_ANSEL1_LENGTH                      equ 0001h
ANSEL_ANSEL1_MASK                        equ 0002h
ANSEL_ANSEL2_POSN                        equ 0002h
ANSEL_ANSEL2_POSITION                    equ 0002h
ANSEL_ANSEL2_SIZE                        equ 0001h
ANSEL_ANSEL2_LENGTH                      equ 0001h
ANSEL_ANSEL2_MASK                        equ 0004h
ANSEL_ANSEL3_POSN                        equ 0003h
ANSEL_ANSEL3_POSITION                    equ 0003h
ANSEL_ANSEL3_SIZE                        equ 0001h
ANSEL_ANSEL3_LENGTH                      equ 0001h
ANSEL_ANSEL3_MASK                        equ 0008h
ANSEL_ANSEL4_POSN                        equ 0004h
ANSEL_ANSEL4_POSITION                    equ 0004h
ANSEL_ANSEL4_SIZE                        equ 0001h
ANSEL_ANSEL4_LENGTH                      equ 0001h
ANSEL_ANSEL4_MASK                        equ 0010h
ANSEL_ANSEL5_POSN                        equ 0005h
ANSEL_ANSEL5_POSITION                    equ 0005h
ANSEL_ANSEL5_SIZE                        equ 0001h
ANSEL_ANSEL5_LENGTH                      equ 0001h
ANSEL_ANSEL5_MASK                        equ 0020h
ANSEL_ANSEL6_POSN                        equ 0006h
ANSEL_ANSEL6_POSITION                    equ 0006h
ANSEL_ANSEL6_SIZE                        equ 0001h
ANSEL_ANSEL6_LENGTH                      equ 0001h
ANSEL_ANSEL6_MASK                        equ 0040h
ANSEL_ANSEL7_POSN                        equ 0007h
ANSEL_ANSEL7_POSITION                    equ 0007h
ANSEL_ANSEL7_SIZE                        equ 0001h
ANSEL_ANSEL7_LENGTH                      equ 0001h
ANSEL_ANSEL7_MASK                        equ 0080h

// Register: ANSELH
#define ANSELH ANSELH
ANSELH                                   equ 0F7Fh
// bitfield definitions
ANSELH_ANSELH_POSN                       equ 0000h
ANSELH_ANSELH_POSITION                   equ 0000h
ANSELH_ANSELH_SIZE                       equ 0004h
ANSELH_ANSELH_LENGTH                     equ 0004h
ANSELH_ANSELH_MASK                       equ 000Fh
ANSELH_ANS8_POSN                         equ 0000h
ANSELH_ANS8_POSITION                     equ 0000h
ANSELH_ANS8_SIZE                         equ 0001h
ANSELH_ANS8_LENGTH                       equ 0001h
ANSELH_ANS8_MASK                         equ 0001h
ANSELH_ANS9_POSN                         equ 0001h
ANSELH_ANS9_POSITION                     equ 0001h
ANSELH_ANS9_SIZE                         equ 0001h
ANSELH_ANS9_LENGTH                       equ 0001h
ANSELH_ANS9_MASK                         equ 0002h
ANSELH_ANS10_POSN                        equ 0002h
ANSELH_ANS10_POSITION                    equ 0002h
ANSELH_ANS10_SIZE                        equ 0001h
ANSELH_ANS10_LENGTH                      equ 0001h
ANSELH_ANS10_MASK                        equ 0004h
ANSELH_ANS11_POSN                        equ 0003h
ANSELH_ANS11_POSITION                    equ 0003h
ANSELH_ANS11_SIZE                        equ 0001h
ANSELH_ANS11_LENGTH                      equ 0001h
ANSELH_ANS11_MASK                        equ 0008h
ANSELH_ANSEL8_POSN                       equ 0000h
ANSELH_ANSEL8_POSITION                   equ 0000h
ANSELH_ANSEL8_SIZE                       equ 0001h
ANSELH_ANSEL8_LENGTH                     equ 0001h
ANSELH_ANSEL8_MASK                       equ 0001h
ANSELH_ANSEL9_POSN                       equ 0001h
ANSELH_ANSEL9_POSITION                   equ 0001h
ANSELH_ANSEL9_SIZE                       equ 0001h
ANSELH_ANSEL9_LENGTH                     equ 0001h
ANSELH_ANSEL9_MASK                       equ 0002h
ANSELH_ANSEL10_POSN                      equ 0002h
ANSELH_ANSEL10_POSITION                  equ 0002h
ANSELH_ANSEL10_SIZE                      equ 0001h
ANSELH_ANSEL10_LENGTH                    equ 0001h
ANSELH_ANSEL10_MASK                      equ 0004h
ANSELH_ANSEL11_POSN                      equ 0003h
ANSELH_ANSEL11_POSITION                  equ 0003h
ANSELH_ANSEL11_SIZE                      equ 0001h
ANSELH_ANSEL11_LENGTH                    equ 0001h
ANSELH_ANSEL11_MASK                      equ 0008h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 0F80h
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h
PORTA_AN0_POSN                           equ 0000h
PORTA_AN0_POSITION                       equ 0000h
PORTA_AN0_SIZE                           equ 0001h
PORTA_AN0_LENGTH                         equ 0001h
PORTA_AN0_MASK                           equ 0001h
PORTA_AN1_POSN                           equ 0001h
PORTA_AN1_POSITION                       equ 0001h
PORTA_AN1_SIZE                           equ 0001h
PORTA_AN1_LENGTH                         equ 0001h
PORTA_AN1_MASK                           equ 0002h
PORTA_AN2_POSN                           equ 0002h
PORTA_AN2_POSITION                       equ 0002h
PORTA_AN2_SIZE                           equ 0001h
PORTA_AN2_LENGTH                         equ 0001h
PORTA_AN2_MASK                           equ 0004h
PORTA_MCLR_POSN                          equ 0003h
PORTA_MCLR_POSITION                      equ 0003h
PORTA_MCLR_SIZE                          equ 0001h
PORTA_MCLR_LENGTH                        equ 0001h
PORTA_MCLR_MASK                          equ 0008h
PORTA_AN3_POSN                           equ 0004h
PORTA_AN3_POSITION                       equ 0004h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0010h
PORTA_T13CKI_POSN                        equ 0005h
PORTA_T13CKI_POSITION                    equ 0005h
PORTA_T13CKI_SIZE                        equ 0001h
PORTA_T13CKI_LENGTH                      equ 0001h
PORTA_T13CKI_MASK                        equ 0020h
PORTA_NOT_MCLR_POSN                      equ 0003h
PORTA_NOT_MCLR_POSITION                  equ 0003h
PORTA_NOT_MCLR_SIZE                      equ 0001h
PORTA_NOT_MCLR_LENGTH                    equ 0001h
PORTA_NOT_MCLR_MASK                      equ 0008h
PORTA_CVREF_POSN                         equ 0000h
PORTA_CVREF_POSITION                     equ 0000h
PORTA_CVREF_SIZE                         equ 0001h
PORTA_CVREF_LENGTH                       equ 0001h
PORTA_CVREF_MASK                         equ 0001h
PORTA_C12IN0M_POSN                       equ 0001h
PORTA_C12IN0M_POSITION                   equ 0001h
PORTA_C12IN0M_SIZE                       equ 0001h
PORTA_C12IN0M_LENGTH                     equ 0001h
PORTA_C12IN0M_MASK                       equ 0002h
PORTA_nMCLR_POSN                         equ 0003h
PORTA_nMCLR_POSITION                     equ 0003h
PORTA_nMCLR_SIZE                         equ 0001h
PORTA_nMCLR_LENGTH                       equ 0001h
PORTA_nMCLR_MASK                         equ 0008h
PORTA_OSC2_POSN                          equ 0004h
PORTA_OSC2_POSITION                      equ 0004h
PORTA_OSC2_SIZE                          equ 0001h
PORTA_OSC2_LENGTH                        equ 0001h
PORTA_OSC2_MASK                          equ 0010h
PORTA_OSC1_POSN                          equ 0005h
PORTA_OSC1_POSITION                      equ 0005h
PORTA_OSC1_SIZE                          equ 0001h
PORTA_OSC1_LENGTH                        equ 0001h
PORTA_OSC1_MASK                          equ 0020h
PORTA_VREFM_POSN                         equ 0000h
PORTA_VREFM_POSITION                     equ 0000h
PORTA_VREFM_SIZE                         equ 0001h
PORTA_VREFM_LENGTH                       equ 0001h
PORTA_VREFM_MASK                         equ 0001h
PORTA_VREFP_POSN                         equ 0001h
PORTA_VREFP_POSITION                     equ 0001h
PORTA_VREFP_SIZE                         equ 0001h
PORTA_VREFP_LENGTH                       equ 0001h
PORTA_VREFP_MASK                         equ 0002h
PORTA_T0CKI_POSN                         equ 0002h
PORTA_T0CKI_POSITION                     equ 0002h
PORTA_T0CKI_SIZE                         equ 0001h
PORTA_T0CKI_LENGTH                       equ 0001h
PORTA_T0CKI_MASK                         equ 0004h
PORTA_CLKOUT_POSN                        equ 0004h
PORTA_CLKOUT_POSITION                    equ 0004h
PORTA_CLKOUT_SIZE                        equ 0001h
PORTA_CLKOUT_LENGTH                      equ 0001h
PORTA_CLKOUT_MASK                        equ 0010h
PORTA_CLKIN_POSN                         equ 0005h
PORTA_CLKIN_POSITION                     equ 0005h
PORTA_CLKIN_SIZE                         equ 0001h
PORTA_CLKIN_LENGTH                       equ 0001h
PORTA_CLKIN_MASK                         equ 0020h
PORTA_INT0_POSN                          equ 0000h
PORTA_INT0_POSITION                      equ 0000h
PORTA_INT0_SIZE                          equ 0001h
PORTA_INT0_LENGTH                        equ 0001h
PORTA_INT0_MASK                          equ 0001h
PORTA_INT1_POSN                          equ 0001h
PORTA_INT1_POSITION                      equ 0001h
PORTA_INT1_SIZE                          equ 0001h
PORTA_INT1_LENGTH                        equ 0001h
PORTA_INT1_MASK                          equ 0002h
PORTA_INT2_POSN                          equ 0002h
PORTA_INT2_POSITION                      equ 0002h
PORTA_INT2_SIZE                          equ 0001h
PORTA_INT2_LENGTH                        equ 0001h
PORTA_INT2_MASK                          equ 0004h
PORTA_PGD_POSN                           equ 0000h
PORTA_PGD_POSITION                       equ 0000h
PORTA_PGD_SIZE                           equ 0001h
PORTA_PGD_LENGTH                         equ 0001h
PORTA_PGD_MASK                           equ 0001h
PORTA_PGC_POSN                           equ 0001h
PORTA_PGC_POSITION                       equ 0001h
PORTA_PGC_SIZE                           equ 0001h
PORTA_PGC_LENGTH                         equ 0001h
PORTA_PGC_MASK                           equ 0002h
PORTA_VPP_POSN                           equ 0003h
PORTA_VPP_POSITION                       equ 0003h
PORTA_VPP_SIZE                           equ 0001h
PORTA_VPP_LENGTH                         equ 0001h
PORTA_VPP_MASK                           equ 0008h
PORTA_C1INP_POSN                         equ 0000h
PORTA_C1INP_POSITION                     equ 0000h
PORTA_C1INP_SIZE                         equ 0001h
PORTA_C1INP_LENGTH                       equ 0001h
PORTA_C1INP_MASK                         equ 0001h
PORTA_SRQ_POSN                           equ 0002h
PORTA_SRQ_POSITION                       equ 0002h
PORTA_SRQ_SIZE                           equ 0001h
PORTA_SRQ_LENGTH                         equ 0001h
PORTA_SRQ_MASK                           equ 0004h
PORTA_ULPWUIN_POSN                       equ 0000h
PORTA_ULPWUIN_POSITION                   equ 0000h
PORTA_ULPWUIN_SIZE                       equ 0001h
PORTA_ULPWUIN_LENGTH                     equ 0001h
PORTA_ULPWUIN_MASK                       equ 0001h
PORTA_LVDIN_POSN                         equ 0005h
PORTA_LVDIN_POSITION                     equ 0005h
PORTA_LVDIN_SIZE                         equ 0001h
PORTA_LVDIN_LENGTH                       equ 0001h
PORTA_LVDIN_MASK                         equ 0020h

// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 0F81h
// bitfield definitions
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h
PORTB_SDI_POSN                           equ 0004h
PORTB_SDI_POSITION                       equ 0004h
PORTB_SDI_SIZE                           equ 0001h
PORTB_SDI_LENGTH                         equ 0001h
PORTB_SDI_MASK                           equ 0010h
PORTB_RX_POSN                            equ 0005h
PORTB_RX_POSITION                        equ 0005h
PORTB_RX_SIZE                            equ 0001h
PORTB_RX_LENGTH                          equ 0001h
PORTB_RX_MASK                            equ 0020h
PORTB_SCL_POSN                           equ 0006h
PORTB_SCL_POSITION                       equ 0006h
PORTB_SCL_SIZE                           equ 0001h
PORTB_SCL_LENGTH                         equ 0001h
PORTB_SCL_MASK                           equ 0040h
PORTB_TX_POSN                            equ 0007h
PORTB_TX_POSITION                        equ 0007h
PORTB_TX_SIZE                            equ 0001h
PORTB_TX_LENGTH                          equ 0001h
PORTB_TX_MASK                            equ 0080h
PORTB_SDA_POSN                           equ 0004h
PORTB_SDA_POSITION                       equ 0004h
PORTB_SDA_SIZE                           equ 0001h
PORTB_SDA_LENGTH                         equ 0001h
PORTB_SDA_MASK                           equ 0010h
PORTB_DT_POSN                            equ 0005h
PORTB_DT_POSITION                        equ 0005h
PORTB_DT_SIZE                            equ 0001h
PORTB_DT_LENGTH                          equ 0001h
PORTB_DT_MASK                            equ 0020h
PORTB_SCK_POSN                           equ 0006h
PORTB_SCK_POSITION                       equ 0006h
PORTB_SCK_SIZE                           equ 0001h
PORTB_SCK_LENGTH                         equ 0001h
PORTB_SCK_MASK                           equ 0040h
PORTB_CK_POSN                            equ 0007h
PORTB_CK_POSITION                        equ 0007h
PORTB_CK_SIZE                            equ 0001h
PORTB_CK_LENGTH                          equ 0001h
PORTB_CK_MASK                            equ 0080h
PORTB_AN10_POSN                          equ 0004h
PORTB_AN10_POSITION                      equ 0004h
PORTB_AN10_SIZE                          equ 0001h
PORTB_AN10_LENGTH                        equ 0001h
PORTB_AN10_MASK                          equ 0010h
PORTB_AN11_POSN                          equ 0005h
PORTB_AN11_POSITION                      equ 0005h
PORTB_AN11_SIZE                          equ 0001h
PORTB_AN11_LENGTH                        equ 0001h
PORTB_AN11_MASK                          equ 0020h

